src/integ-test/bdd-test/resources/xml/sendPaymentOutcomeV2Body_MBD_full.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <nod:sendPaymentOutcomeV2Request>
            <idPSP>$idPSP</idPSP>
            <idBrokerPSP>$idBrokerPSP</idBrokerPSP>
            <idChannel>$idChannel</idChannel>
            <password>$password</password>
            <paymentTokens>
                <paymentToken>$paymentToken</paymentToken>
            </paymentTokens>
            <outcome>$outcome</outcome>
            <!--Optional:-->
            <details>
                <paymentMethod>$paymentMethod</paymentMethod>
                <!--Optional:-->
				<paymentChannel>app</paymentChannel>
                <fee>$fee</fee>
                <!--Optional:-->
				<payer>
					<uniqueIdentifier>
						<entityUniqueIdentifierType>G</entityUniqueIdentifierType>
						<entityUniqueIdentifierValue>77777777777_01</entityUniqueIdentifierValue>
					</uniqueIdentifier>
					<fullName>name</fullName>
					<!--Optional:-->
					<streetName>street</streetName>
					<!--Optional:-->
					<civicNumber>civic</civicNumber>
					<!--Optional:-->
					<postalCode>postal</postalCode>
					<!--Optional:-->
					<city>#cityspo#</city>
					<!--Optional:-->
					<stateProvinceRegion>state</stateProvinceRegion>
					<!--Optional:-->
					<country>IT</country>
					<!--Optional:-->
					<e-mail>prova@test.it</e-mail>
				</payer>
                <applicationDate>2021-12-12</applicationDate>
                <transferDate>2021-12-11</transferDate>
                <marcheDaBollo>
                    <marcaDaBollo>
                        <paymentToken>$paymentToken</paymentToken>
                        <idTransfer>$idTransfer</idTransfer>
                        <MBDAttachment>$MBDAttachment</MBDAttachment>
                    </marcaDaBollo>
                </marcheDaBollo>
            </details>
        </nod:sendPaymentOutcomeV2Request>
    </soapenv:Body>
</soapenv:Envelope>